{
  "flags": [
    {
      "short": "",
      "long": "--files",
      "required": false,
      "help": "Print each file that would be searched without actually performing the search. This is useful to determine whether a particular file is being searched or not.",
      "example": "",
      "type": "string"
    },
    {
      "short": "",
      "long": "--generate=KIND",
      "required": false,
      "help": "This flag instructs ripgrep to generate some special kind of output identified by KIND and then quit without searching. KIND can be one of the following values: man, complete-bash, complete-zsh, complete-fish, complete-powershell.",
      "example": "",
      "type": "string"
    },
    {
      "short": "",
      "long": "--no-config",
      "required": false,
      "help": "When set, ripgrep will never read configuration files. When this flag is present, ripgrep will not respect the RIPGREP_CONFIG_PATH environment variable.",
      "example": "",
      "type": "string"
    },
    {
      "short": "",
      "long": "--pcre2-version",
      "required": false,
      "help": "When this flag is present, ripgrep will print the version of PCRE2 in use, along with other information, and then exit. If PCRE2 is not available, then ripgrep will print an error message and exit with an error code.",
      "example": "",
      "type": "string"
    },
    {
      "short": "",
      "long": "--type-list",
      "required": false,
      "help": "Show all supported file types and their corresponding globs. This takes any --type-add and --type-clear flags given into account. Each type is printed on its own line, followed by a : and then a comma-delimited list of globs for that type on the same line.",
      "example": "",
      "type": "string"
    },
    {
      "short": "-V",
      "long": "--version",
      "required": false,
      "help": "This flag prints ripgrep's version. This also may print other relevant information, such as the presence of target specific optimizations and the git revision that this build of ripgrep was compiled from.",
      "example": "",
      "type": "string"
    }
  ]
}
